app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "description", "genre", "image", "birthDate", "deathDate", "activeFrom", "activeUntil", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def random
    limit = limit_params[:limit]
    @artists = Artist.order("RANDOM()").limit(limit)
---
SELECT  "artists".* FROM "artists" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 10]]

  def update
    respond_to do |format|
      if @artist.update(artist_params)
---
UPDATE "artists" SET "description" = $1, "genre" = $2, "updated_at" = $3 WHERE "artists"."id" = $4  [["description", "Great artist."], ["genre", "Pop"], ["updated_at", 2017-06-10 18:31:37 UTC], ["id", 1]]

    def set_artist
      @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]