app/controllers/artist_similarities_controller.rb

  def index
    @artist_similarities = ArtistSimilarity.all
---
SELECT "artist_similarities".* FROM "artist_similarities"

  def create
    @artist_similarity = ArtistSimilarity.new(artist_similarity_params)

    respond_to do |format|
      if @artist_similarity.save
---
INSERT INTO "artist_similarities" ("artist_id", "similar_artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist_id", 1], ["similar_artist_id", 1], ["created_at", 2017-06-10 18:41:18 UTC], ["updated_at", 2017-06-10 18:41:18 UTC]]

    def set_artist_similarity
      @artist_similarity = ArtistSimilarity.find(params[:id])
---
SELECT  "artist_similarities".* FROM "artist_similarities" WHERE "artist_similarities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]