app/controllers/similar_artists_controller.rb

  def index
    @similar_artists = SimilarArtist.all
---
SELECT "similar_artists".* FROM "similar_artists"

  def create
    @similar_artist = SimilarArtist.new(similar_artist_params)

    respond_to do |format|
      if @similar_artist.save
---
INSERT INTO "similar_artists" ("name", "description", "genre", "image", "birthDate", "deathDate", "activeFrom", "activeUntil", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def set_similar_artist
      @similar_artist = SimilarArtist.find(params[:id])
---
SELECT  "similar_artists".* FROM "similar_artists" WHERE "similar_artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]